README.org
#+TITLE: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+STARTUP: overview

* Base
** Use lexical binding

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t; -*-

#+end_src

** Package management
*** Bootstrap straight.el

Instead of built-in ~package.el~, this configuration is based on ~straight.el~ which enables to use packages from custom sources (e.g. fork of some package or entirely new one which is not yet on MELPA or ELPA).

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Use `straight.el' for `use-package' expressions
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

  (straight-use-package 'org)
  (setenv "PATH" (concat (getenv "PATH") ":/home/jonatan/.ghcup/bin"))

#+end_src

** Define system variables

This allows to easily exclude packages that are not needed on specific OS.

#+begin_src emacs-lisp

  (defconst *is-a-mac* (eq system-type 'darwin))
  (defconst *is-a-linux* (eq system-type 'gnu/linux))

#+end_src
** Configure environment
#+begin_src emacs-lisp
  ;; Ensure that environment variables are the same as the user’s shell
  (when *is-a-mac*
    (use-package exec-path-from-shell
      :straight t
      :if (memq window-system '(mac ns x))
      :hook (exec-path-from-shell-initialize))
    (when (featurep 'ns)
      (defun ns-raise-emacs ()
	"Raise Emacs."
	(ns-do-applescript "tell application \"Emacs\" to activate"))

      (defun ns-raise-emacs-with-frame (frame)
	"Raise Emacs and select the provided frame."
	(with-selected-frame frame
	  (when (display-graphic-p)
	    (ns-raise-emacs))))
      (add-hook 'after-make-frame-functions 'ns-raise-emacs-with-frame)
      (when (display-graphic-p)
	(ns-raise-emacs))))
#+end_src
** Tangle configuration

#+begin_src emacs-lisp

  (defun bore/org-babel-tangle-config ()
    "Automatically tangle Emacs.org config when saving a file."
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bore/org-babel-tangle-config)))
#+end_src

** Performance
*** Disable GUI elements in early-init.el file

#+begin_src emacs-lisp :tangle ./early-init.el

  ;; -*- lexical-binding: t; -*-

  ;; Since Emacs 27, an early configuration file early-init.el can be provided to
  ;; handle initialization to be done before init.el is loaded.

  (setq-default load-prefer-newer t           ; to reduce the risk of loading outdated byte code files
                package-enable-at-startup nil ; package initialization occurs after `early-init-file'.
                package-native-compile t)     ; native is better, I guess?

  (tooltip-mode -1)    ; disable tooltips
  (menu-bar-mode -1)   ; disable the menu bar

  (if (fboundp 'tool-bar-mode)
      (tool-bar-mode -1))         ; disable the toolbar
  (if (fboundp 'scroll-bar-mode)
      (scroll-bar-mode -1))       ; disable visible scrollbar

  (add-to-list 'default-frame-alist '(undecorated . t))
  (custom-set-variables
   '(initial-frame-alist (quote ((fullscreen . maximized)))))
#+end_src

*** Startup

#+begin_src emacs-lisp

  ;; Some Garbage Collection Magic Hack
  (use-package gcmh
    :straight t
    :config
    (setq gcmh-idle-delay 0.5  ; default is 15s
          gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
    (gcmh-mode 1))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src

*** Native compilation

#+begin_src emacs-lisp

  ;; Silence compiler warnings as they can be pretty disruptive
  (setq native-comp-async-report-warnings-errors nil)

  ;; Set the right directory to store the native comp cache
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

#+end_src

*** Prohibit littering

Use no-littering to automatically set common paths to the new user-emacs-directory.

#+begin_src emacs-lisp

  (use-package no-littering)

#+end_src

* Personal information

#+begin_src emacs-lisp

  (setq user-full-name "Jonatan Borkowski"
        user-mail-address "jonatan.borkowski@pm.me")

#+end_src

* Appearance
** Modus Themes
#+begin_src emacs-lisp
  (use-package modues-themes
    :straight nil
    :defer nil
    :bind
    (("C-c t t" . modus-themes-toggle))
    :config
    (setq modus-themes-slanted-constructs t
	  modus-themes-bold-constructs t
	  modus-themes-mixed-fonts t
	  modus-themes-scale-headings t
	  modus-themes-subtle-line-numbers t
	  modus-themes-inhibit-reload nil
	  modus-themes-mode-line '(borderless)
	  modus-themes-syntax '(faint)
	  modus-themes-lang-checkers '(faint)
	  modus-themes-completions '(opinionated)
	  modus-themes-diffs 'desaturated
	  modus-themes-operandi-color-overrides
	  '((bg-main . "#fafafa")
	    (fg-main . "#101010"))
	  modus-themes-vivendi-color-overrides
	  '((bg-main . "#101010")
	    (fg-main . "#fafafa"))
	  )

    )
  (load-theme 'modus-vivendi)
#+end_src
** Nyan Cat
#+begin_src emacs-lisp

  (use-package nyan-mode)
  (nyan-mode 1)

#+end_src

** Ligatures

#+begin_src emacs-lisp
  (use-package ligature
    :straight (ligature :host github
                        :repo "mickeynp/ligature.el")
    :config
    ;; Enable all Recursive ligatures in programming modes
    (ligature-set-ligatures 'prog-mode '("==" "===" "!=" "!==" "=/=" "!!" "??"
                                         "%%" "&&" "&&&" "||" "|||" "=>" "->" "<-"
                                         "##" "###" "####" "//" "f\"" "f'" "${"
                                         "?." "?:" "/*" "*/" "///" "'''" "\"\"\""
                                         "```" "<!--" "-->" ">-" "-<" "::" ">>"
                                         ">>>" "<<" "<<<" "://" "++" "+++" "--"
                                         "---" "**" "***" "+=" "-=" "*=" "/=" "=~"
                                         "<*" "<*>" "<|" "|>" "<|>" "<$>" "<=>"
                                         "<>" "<+>" ">>-" "-<<" "__" "-[ ]" "-[x]"
                                         "\\b" "\\n" "\\r" "\\t" "\\v" "|=" "!~"
                                         "<<~" "<<=" ">>=" "=<<"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))

#+end_src

** Fonts
#+begin_src emacs-lisp
  (defun bore/with-font-faces ()
    "Setup all Emacs font faces."
    (when (display-graphic-p)
      (set-face-attribute 'default nil :font (font-spec :family "Iosevka" :size 14 :weight 'regular))
      (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka" :size 14 :weight 'regular))
      (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Aile" :size 14 :weight 'regular))))

  (add-hook 'after-init-hook 'bore/with-font-faces)
  (add-hook 'server-after-make-frame-hook 'bore/with-font-faces)

  ;; Make those lambdas pretty again
  (global-prettify-symbols-mode t)

#+end_src

*** All the icons
#+begin_src emacs-lisp
  ;; For the first time remember to run M-x all-the-icons-install-fonts
  (use-package all-the-icons)
#+end_src

** Line numbers

#+begin_src emacs-lisp

  ;; Happy people don't count numbers, they also have a small performance boost to Emacs
  (setq display-line-numbers-type nil)

  ;; But for sure disable line numbers in some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  eshell-mode-hool))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

