init.el
;; -*- lexical-binding: t; -*-

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Use `straight.el' for `use-package' expressions
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(straight-use-package 'org)
(setenv "PATH" (concat (getenv "PATH") ":/home/jonatan/.ghcup/bin"))

(defconst *is-a-mac* (eq system-type 'darwin))
(defconst *is-a-linux* (eq system-type 'gnu/linux))

;; Ensure that environment variables are the same as the user’s shell
(when *is-a-mac*
  (use-package exec-path-from-shell
    :straight t
    :if (memq window-system '(mac ns x))
    :hook (exec-path-from-shell-initialize))
  (when (featurep 'ns)
    (defun ns-raise-emacs ()
      "Raise Emacs."
      (ns-do-applescript "tell application \"Emacs\" to activate"))

    (defun ns-raise-emacs-with-frame (frame)
      "Raise Emacs and select the provided frame."
      (with-selected-frame frame
	(when (display-graphic-p)
	  (ns-raise-emacs))))
    (add-hook 'after-make-frame-functions 'ns-raise-emacs-with-frame)
    (when (display-graphic-p)
      (ns-raise-emacs))))

(defun bore/org-babel-tangle-config ()
  "Automatically tangle Emacs.org config when saving a file."
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bore/org-babel-tangle-config)))

;; Some Garbage Collection Magic Hack
(use-package gcmh
  :straight t
  :config
  (setq gcmh-idle-delay 0.5  ; default is 15s
        gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
  (gcmh-mode 1))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;; Silence compiler warnings as they can be pretty disruptive
(setq native-comp-async-report-warnings-errors nil)

;; Set the right directory to store the native comp cache
(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

(use-package no-littering)

(setq user-full-name "Jonatan Borkowski"
      user-mail-address "jonatan.borkowski@pm.me")

(use-package emacs
  :straight nil
  :bind
  (("C-c t t" . modus-themes-toggle))
  :config
  (setq modus-themes-slanted-constructs t
	modus-themes-bold-constructs t
	modus-themes-mixed-fonts t
	modus-themes-scale-headings t
	modus-themes-subtle-line-numbers t
	modus-themes-inhibit-reload nil
	modus-themes-mode-line '(borderless)
	modus-themes-syntax '(faint)
	modus-themes-lang-checkers '(faint)
	modus-themes-completions '(opinionated)
	modus-themes-diffs 'desaturated)
  (load-theme 'modus-vivendi))

(use-package nyan-mode)
(nyan-mode 1)

(use-package ligature
  :straight (ligature :host github
                      :repo "mickeynp/ligature.el")
  :config
  ;; Enable all Recursive ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("==" "===" "!=" "!==" "=/=" "!!" "??"
                                       "%%" "&&" "&&&" "||" "|||" "=>" "->" "<-"
                                       "##" "###" "####" "//" "f\"" "f'" "${"
                                       "?." "?:" "/*" "*/" "///" "'''" "\"\"\""
                                       "```" "<!--" "-->" ">-" "-<" "::" ">>"
                                       ">>>" "<<" "<<<" "://" "++" "+++" "--"
                                       "---" "**" "***" "+=" "-=" "*=" "/=" "=~"
                                       "<*" "<*>" "<|" "|>" "<|>" "<$>" "<=>"
                                       "<>" "<+>" ">>-" "-<<" "__" "-[ ]" "-[x]"
                                       "\\b" "\\n" "\\r" "\\t" "\\v" "|=" "!~"
                                       "<<~" "<<=" ">>=" "=<<"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))

(defun bore/with-font-faces-mac ()
  "Setup all Emacs font faces."
  (when (display-graphic-p)
    (set-face-attribute 'default nil :font (font-spec :family "Iosevka" :size 14 :weight 'regular))
    (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka" :size 14 :weight 'regular))
    (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Aile" :size 14 :weight 'regular))))

(defun bore/with-font-faces-linux ()
  "Setup all Emacs font faces."
  (when (display-graphic-p)
    (set-face-attribute 'default nil :font (font-spec :family "Iosevka Etoile" :size 20 :weight 'regular))
    (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka Etoile" :size 20 :weight 'regular))
    (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Aile" :size 20 :weight 'regular))))

(when *is-a-mac*
  (add-hook 'after-init-hook 'bore/with-font-faces-mac)
  (add-hook 'server-after-make-frame-hook 'bore/with-font-faces))


(when *is-a-linux*
  (add-hook 'after-init-hook 'bore/with-font-faces-linux)
  (add-hook 'server-after-make-frame-hook 'bore/with-font-linux))

;; Make those lambdas pretty again
(global-prettify-symbols-mode t)

;; For the first time remember to run M-x all-the-icons-install-fonts
(use-package all-the-icons)

;; Happy people don't count numbers, they also have a small performance boost to Emacs
(setq display-line-numbers-type nil)

;; But for sure disable line numbers in some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                vterm-mode-hook
                eshell-mode-hool))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
