README.org
** Tabs

#+begin_src emacs-lisp
  (use-package tab-bar
    :straight nil
    :config
    (setq tab-bar-close-button-show nil
          tab-bar-new-button nil
          tab-bar-separator " "
          tab-bar-show 1)
    :init
    (setq tab-bar-new-tab-to 'rightmost
          tab-bar-close-tab-select 'recent
          ;; set default tab name to current buffer.
          ;; alternative is to set new tab to scratch - tab-bar-new-tab-choice "*scratch*"
          tab-bar-new-tab-choice t
          tab-bar-tab-name-function 'tab-bar-tab-name-current
          tab-bar-format '(tab-bar-format-history tab-bar-format-tabs)
          ))

  (tab-bar-history-mode 1)
#+end_src
** TTY tweaks
#+begin_src emacs-lisp
  (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│))

  (setq mode-line-end-spaces nil)
#+end_src

** Power Mode
#+begin_src emacs-lisp
  ;;(use-package power-mode
  ;;  :straight t)
#+end_src
* Editor
** Better defaults

#+begin_src emacs-lisp
  (setq inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-startup-message t
        initial-scratch-message nil
        kill-do-not-save-duplicates t
        require-final-newline t
        password-cache-expiry nil
        custom-safe-themes t
        scroll-margin 2
        ;; select-enable-clipboard t
        visible-bell t
        warning-minimum-level :error)

  (recentf-mode 1)
  (global-so-long-mode 1)
  (fset 'yes-or-no-p 'y-or-n-p)
  (global-auto-revert-mode t)
  (set-default-coding-systems 'utf-8)
  (global-hl-line-mode 1)

  (setq x-alt-keysym 'meta) ;; Alt as Meta key
#+end_src

** Buffers

#+begin_src emacs-lisp
  (use-package emacs
    :straight nil
    :bind
    (("C-x K"   . bore/kill-buffer)
     ("C-z"     . repeat)
     ("C-c q q" . kill-emacs))
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
		    (replace-regexp-in-string
		     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
		     crm-separator)
		    (car args))
	    (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
	  '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Clean up whitespace, newlines and line breaks
    (add-hook 'before-save-hook 'delete-trailing-whitespace)

    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers.
    ;;(setq read-extended-command-predicate
    ;;      #'command-completion-default-include-p)

    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (setq tab-always-indent 'complete))

  (defun bore/kill-buffer (&optional arg)
    "Kill buffer which is currently visible (ARG)."
    (interactive "P")
    (if arg
	(call-interactively 'kill-buffer)
      (kill-this-buffer)))
#+end_src


#+begin_src emacs-lisp

  (use-package ibuffer
    :straight nil
    :bind (("C-x C-b" . ibuffer))
    :config
    (setq ibuffer-expert t
          ibuffer-display-summary nil
          ibuffer-use-other-window nil
          ibuffer-show-empty-filter-groups nil
          ibuffer-movement-cycle nil
          ibuffer-default-sorting-mode 'filename/process
          ibuffer-use-header-line t
          ibuffer-default-shrink-to-minimum-size nil
          ibuffer-formats
          '((mark modified read-only locked " "
                  (name 40 40 :left :elide)
                  " "
                  (size 9 -1 :right)
                  " "
                  (mode 16 16 :left :elide)
                  " " filename-and-process)
            (mark " "
                  (name 16 -1)
                  " " filename))
          ibuffer-saved-filter-groups nil
          ibuffer-old-time 48)
    (add-hook 'ibuffer-mode-hook #'hl-line-mode))

#+end_src

** History

#+begin_src emacs-lisp
  (use-package savehist
    :straight nil
    :config
    (setq savehist-save-minibuffer-history t
          savehist-autosave-interval nil
          savehist-additional-variables
          '(kill-ring
            register-alist
            mark-ring global-mark-ring
            search-ring regexp-search-ring))
    (savehist-mode 1))
  (setq undo-limit 80000000
        history-limit 5000
        history-delete-duplicates t)

#+end_src

** Autosave

#+begin_src emacs-lisp

  ;; Enable autosave and backup
  (setq auto-save-default t
        auto-save-file-name-transforms `((".*" ,(expand-file-name "auto-save" user-emacs-directory) t))
        make-backup-files t
        backup-directory-alist `((".*" . ,(expand-file-name "backup" user-emacs-directory)))
        backup-by-copying t
        version-control t
        delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        create-lockfiles nil)

#+end_src

** Recent files

#+begin_src emacs-lisp

  (use-package recentf
    :straight nil
    :commands recentf-open-files
    :config
    (setq recentf-max-menu-items 100
          recentf-max-saved-items 100)
    (recentf-mode 1))

#+end_src

** Parens

#+begin_src emacs-lisp

  (use-package paren
    :straight nil
    :config
    (setq show-paren-delay 0
          show-paren-highlight-openparen t
          show-paren-when-point-inside-paren t)
    (show-paren-mode 1))

  ;; A little bit of rainbow here and there
  (use-package rainbow-delimiters
    :straight t
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src
** Electric behavior

#+begin_src emacs-lisp

  (use-package elec-pair
    :straight nil
    :config
    (setq electric-pair-inhibit-predicate'electric-pair-conservative-inhibit
          electric-pair-skip-self 'electric-pair-default-skip-self
          electric-pair-skip-whitespace nil
          electric-pair-preserve-balance t)
    (electric-indent-mode 1)
    (electric-pair-mode 1))

#+end_src

** Navigation
*** Scrolling

#+begin_src emacs-lisp
  (setq scroll-conservatively 101                    ; value greater than 100 gets rid of half page jumping
        mouse-wheel-scroll-amount '(3 ((shift) . 3)) ; how many lines at a time
        mouse-wheel-progressive-speed t              ; accelerate scrolling
        mouse-wheel-follow-mouse 't)                 ; scroll window under mouse
#+end_src

*** Isearch

#+begin_src emacs-lisp

  (use-package isearch
    :straight nil
    :bind
    :config
    (setq isearch-lazy-count t))

#+end_src

*** Avy

#+begin_src emacs-lisp

  ;; Just a thought... and you are there!
  (use-package avy
    :straight t
    :bind (("C-'" . avy-goto-char-timer)
           :map isearch-mode-map
           ("C-'" . avy-isearch))
    :config
    (setq avy-keys '(?n ?e ?i ?s ?t ?r ?i ?a)
          avy-timeout-seconds .3
          avy-background t))

#+end_src

*** Ace-window

#+begin_src emacs-lisp

  (use-package ace-window
    :straight t
    :commands ace-window
    :bind ("M-o" . ace-window)
    :config
    (setq aw-keys '(?n ?e ?i ?s ?t ?r ?i ?a)))

#+end_src

*** Winner-mode

#+begin_src emacs-lisp

  ;; Allow me to undo my windows
  (use-package winner
    :straight nil
    :hook
    (after-init . winner-mode))

#+end_src

** Mode-line

#+begin_src emacs-lisp
  (setq mode-line-position-line-format `(" %l:%c"))
  (setq mode-line-position-column-line-format '(" %l,%c"))
  (setq mode-line-compact nil)
  (setq-default mode-line-format
                '("%e"
                  mode-line-front-space
                  mode-line-mule-info
                  mode-line-client
                  mode-line-modified
                  mode-line-remote
                  mode-line-frame-identification
                  mode-line-buffer-identification
                  "  "
                  mode-line-position
                  "  "
                  (vc-mode vc-mode)
                  "  "
                  mode-line-modes
                  "  "
                  mode-line-misc-info
                  mode-line-end-spaces))

  (use-package minions
    :straight t
    :config
    (minions-mode 1))
#+end_src

