README.org
** Helpful packages

#+begin_src emacs-lisp
  (use-package which-key
    :straight t
    :defer t
    :init (which-key-mode)
    :config
    (setq which-key-idle-delay 0.5))

  (use-package helpful
    :straight t
    :commands helpful-callable helpful-variable helpful-command helpful-key
    :bind
    ([remap describe-function] . helpful-function)
    ([remap describe-command]  . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key]      . helpful-key))

#+end_src
** Highlight TODO in code
#+begin_src emacs-lisp
  (use-package hl-todo
    :straight t
    :hook (prog-mode . hl-todo-mode))
#+end_src

** Multiple cursors
#+begin_src emacs-lisp
  (use-package iedit
    :straight t
    :commands iedit-mode iedit-rectangle-mode
    :bind ("C-;" . iedit-mode))

  (use-package evil-multiedit
    :defer t)

  (use-package multiple-cursors
    :straight t
    :bind (("C-<" . mc/mark-previous-like-this)
           ("C->" . mc/mark-next-like-this)
           ("C-c C-<" . mc/mark-all-like-this)
           ("C-S-<mouse-1>" . mc/add-cursor-on-click)))

  ;; add evil-mc
#+end_src

** Clipetty
#+begin_src emacs-lisp
  (use-package clipetty
    :straight t
    :unless (display-graphic-p)
    :hook (tty-setup . global-clipetty-mode))
#+end_src
* Tools
** Spellcheck
#+begin_src emacs-lisp
  (use-package ispell
    :straight nil
    :config
    (setq ispell-program-name "hunspell"
          ispell-dictionary "en_US,pl_PL")
    (ispell-set-spellchecker-params)
    (ispell-hunspell-add-multi-dic ispell-dictionary))

  (use-package flyspell
    :hook ((message-mode git-commit-mode org-mode text-mode) . flyspell-mode)
    :bind (:map flyspell-mode-map
                ("C-." . nil)
                ("C-;" . nil))
    :config
    (setq flyspell-issue-welcome-flag nil
          flyspell-issue-message-flag nil))
#+end_src

** Emacs Web Wowser
#+begin_src emacs-lisp
  (use-package browse-url
    :straight nil
    :config
    (setq browse-url-secondary-browser-function 'eww-browse-url
          browse-url-browser-function 'browse-url-default-browser))

  (use-package shr
    :straight nil
    :config
    (setq shr-use-colors nil             ; t is bad for accessibility
          shr-use-fonts nil              ; t is not for me
          shr-max-image-proportion 0.6
          shr-image-animate nil          ; No GIFs, thank you!
          shr-width nil
          shr-discard-aria-hidden t
          shr-cookie-policy nil))

  (use-package url-cookie
    :straight nil
    :config (setq url-cookie-untrusted-urls '(".*")))

  (use-package eww
    :straight nil
    :bind ("C-c o b" . eww)
    :config
    (setq eww-restore-desktop t
          eww-desktop-remove-duplicates t
          eww-header-line-format nil
          eww-search-prefix "https://duckduckgo.com/?ia="
          eww-download-directory (expand-file-name "~/Downloads")
          eww-suggest-uris
          '(eww-links-at-point
            thing-at-point-url-at-point)
          eww-history-limit 150
          eww-use-external-browser-for-content-type
          "\\`\\(video/\\|audio\\)"
          eww-browse-url-new-window-is-tab nil
          eww-form-checkbox-selected-symbol "[X]"
          eww-form-checkbox-symbol "[ ]"
          eww-retrieve-command nil))
#+end_src

** PDF

#+begin_src emacs-lisp
  (use-package pdf-tools
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :magic ("%PDF" . pdf-view-mode))
#+end_src

** Dired

#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :commands dired dired-jump
    :config
    (setq dired-kill-when-opening-new-dired-buffer t
          delete-by-moving-to-trash t
          dired-dwim-target t
          dired-recursive-copies 'always
          dired-recursive-deletes 'always))

  (use-package consult-dir
    :straight t
    :bind (("C-x C-d" . consult-dir)
           :map vertico-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file)))

#+end_src

** Project

#+begin_src emacs-lisp
  (use-package project
    :straight t)
#+end_src

** Git

#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :commands magit-file-delete
    :init
    (setq magit-auto-revert-mode nil)             ; `global-auto-revert-mode'
    :config
    (setq transient-default-level 5
          magit-diff-refine-hunk t                ; show granular diffs in selected hunk
          magit-save-repository-buffers nil       ; don't autosave repo buffers
          magit-revision-insert-related-refs nil) ; don't display parent/related refs in commit buffers
    :custom
    (magit-section-visibility-indicator nil)
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package magit-todos
    :after magit
    :config
    (setq magit-todos-keyword-suffix "\\(?:([^)]+)\\)?:?") ; make colon optional
    (define-key magit-todos-section-map "j" nil))


  (use-package ediff
    :straight nil
    :config
    (setq ediff-merge-split-window-function 'split-window-horizontally
          ediff-split-window-function 'split-window-horizontally
          ediff-window-setup-function 'ediff-setup-windows-plain))

  (use-package diff-hl
    :straight t
    :config
    (setq diff-hl-draw-borders nil)
    (global-diff-hl-mode 1))
#+end_src

** Terminal
#+begin_src emacs-lisp
  (use-package eshell
    :straight nil
    :commands eshell
    :bind ("C-c o E" . eshell)
    :config
    (setq eshell-kill-processes-on-exit t
          eshell-highlight-prompt t
          eshell-hist-ignoredups t
          eshell-prompt-regexp "^.* λ "))

  (use-package eshell-syntax-highlighting
    :straight t
    :after eshell-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (use-package eshell-toggle
    :straight t
    :commands eshell-toggle
    :bind ("C-c o e" . eshell-toggle)
    :custom
    (eshell-toggle-size-fraction 4)
    (eshell-toggle-run-command nil))

  (use-package vterm
    :straight t
    :bind
    ("C-c o t" . vterm-other-window)
    ("C-c o T" . vterm)
    :config
    (setq vterm-kill-buffer-on-exit t
          vterm-always-compile-module t
          vterm-max-scrollback 5000
          vterm-timer-delay nil
          vterm-shell "/bin/zsh"))

#+end_src
** Rainbow mode
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :straight t
    :commands rainbow-mode)
#+end_src

** Olivetti
#+begin_src emacs-lisp
  (use-package olivetti
    :straight t
    :commands olivetti-mode
    :config
    (setq olivetti-body-width 100))
#+end_src
** OS TTY

#+begin_src emacs-lisp
  (setq xterm-set-window-title t)
  (setq visible-cursor nil)
  ;; Enable the mouse in terminal Emacs
  (add-hook 'tty-setup-hook #'xterm-mouse-mode)
#+end_src

** Embark

#+begin_src emacs-lisp
  (use-package embark
    :straight t
    :bind
    (("C-." . embark-act)
     ("C-h B" . embark-bindings))
    :init
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :straight t
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Yasnipet

#+begin_src emacs-lisp
  (use-package yasnippet
    :straight t
    :config
    (setq yas-snippet-dirs
          (append yas-snippet-dirs
                  '("~/.emacs.d/snippets")))
    (yas-global-mode 1)
    )
#+end_src
