README.org
** TempEL
#+begin_src emacs-lisp
  ;; Configure Tempel
  (use-package tempel
    :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
	   ("M-*" . tempel-insert))

    :init

    ;; Setup completion at point
    (defun tempel-setup-capf ()
      ;; Add the Tempel Capf to `completion-at-point-functions'. `tempel-expand'
      ;; only triggers on exact matches. Alternatively use `tempel-complete' if
      ;; you want to see all matches, but then Tempel will probably trigger too
      ;; often when you don't expect it.
      ;; NOTE: We add `tempel-expand' *before* the main programming mode Capf,
      ;; such that it will be tried first.
      (setq-local completion-at-point-functions
		  (cons #'tempel-expand
			completion-at-point-functions)))

    (add-hook 'prog-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf)
    (add-hook 'prog-mode-hook #'tempel-abbrev-mode)

    ;; Optionally make the Tempel templates available to Abbrev,
    ;; either locally or globally. `expand-abbrev' is bound to C-x '.
    ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
    ;; (tempel-global-abbrev-mode)
    )
#+end_src

** Elfeed RSS
#+begin_src emacs-lisp
  (use-package elfeed
    :straight t
    :bind
    ("C-x w" . elfeed))

  (use-package elfeed-org
    :straight t
    :config
    (elfeed-org)
    (setq rmh-elfeed-org-files (list "~/org/elfeed.org")))
#+end_src

** Vertico

#+begin_src emacs-lisp
  ;; Enable vertigo
  (use-package vertico
    :straight t
    :init
    (vertico-mode)
    (setq vertico-resize t
	  vertico-cycle t
	  vertico-count 17
	  completion-in-region-function
	  (lambda (&rest args)
	    (apply (if vertico-mode
		       #'consult-completion-in-region
		     #'completion--in-region)
		   args))))
#+end_src

** Orderless

#+begin_src emacs-lisp

  ;; Use the orderless completion style
  (use-package orderless
    :straight t
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

#+end_src

** Marginalia

#+begin_src emacs-lisp

  ;; I want to know every detail... one the margin
  (use-package marginalia
    :after vertico
    :straight t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy
                             marginalia-annotators-light
                             nil))
    :init
    (marginalia-mode))

#+end_src
** Embark

#+begin_src emacs-lisp

  (use-package embark
    :ensure t

    :bind
    (("C-." . embark-act)
     ("C-h B" . embark-bindings))

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :after (embark consult)
    :config
    (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode))

#+end_src
** Consult
#+begin_src emacs-lisp

  (use-package consult
    :straight t
    :defer t
    :bind (
	   ;; C-x bindings (ctl-x-map)
	   ("C-x C-r" . consult-recent-file)
	   ("C-x M-:" . consult-complex-command)     ; orig. repeat-complex-command
	   ("C-x b"   . consult-buffer)              ; orig. switch-to-buffer
	   ("C-x M-k" . consult-kmacro)
	   ("C-x M-m" . consult-minor-mode-menu)
	   ("C-x r b" . consult-bookmark)            ; override bookmark-jump
	   ("C-x 4 b" . consult-buffer-other-window) ; orig. switch-to-buffer-other-window
	   ("C-x 5 b" . consult-buffer-other-frame)  ; orig. switch-to-buffer-other-frame
	   ;; Other custom bindings
	   ("M-y" . consult-yank-pop)                ; orig. yank-pop
	   ("<help> a" . consult-apropos)            ; orig. apropos-command
	   ;; M-g bindings (goto-map)
	   ("M-g e" . consult-compile-error)
	   ("M-g f" . consult-flycheck)               ; Alternative: consult-flycheck
	   ("M-g g" . consult-goto-line)             ; orig. goto-line
	   ("M-g M-g" . consult-goto-line)           ; orig. goto-line
	   ("M-g o" . consult-outline)               ; Alternative: consult-org-heading
	   ("M-g m" . consult-mark)
	   ("M-g k" . consult-global-mark)
	   ("M-g i" . consult-imenu)
	   ("M-g I" . consult-imenu-multi)
	   ;; M-s bindings (search-map)
	   ("M-s f" . consult-find)
	   ("M-s F" . consult-locate)
	   ("M-s g" . consult-grep)
	   ("M-s G" . consult-git-grep)
	   ("M-s r" . consult-ripgrep)
	   ("M-s l" . consult-line)
	   ("M-s L" . consult-line-multi)
	   ("M-s m" . consult-multi-occur)
	   ("M-s k" . consult-keep-lines)
	   ("M-s u" . consult-focus-lines)
	   ;; Isearch integration
	   ("M-s e" . consult-isearch-history)
	   :map isearch-mode-map
	   ("M-e" . consult-isearch-history)          ; orig. isearch-edit-string
	   ("M-s e" . consult-isearch-history))       ; orig. isearch-edit-string

    :hook (completion-list-mode . consult-preview-at-point-mode)
    :init
    (setq register-preview-delay 0
	  register-preview-function #'consult-register-format)
    (advice-add #'register-preview :override #'consult-register-window)
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
    (setq xref-show-xrefs-function #'consult-xref
	  xref-show-definitions-function #'consult-xref)
    :config
    (consult-customize
     consult-theme
     :preview-key '(:debounce 0.5 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-project-buffer consult--source-bookmark
     :preview-key (kbd "M-."))

    (setq consult-narrow-key "<"
	  consult-line-numbers-widen t
	  consult-async-min-input 2
	  consult-async-refresh-delay  0.15
	  consult-async-input-throttle 0.2
	  consult-async-input-debounce 0.1)

    (setq consult-project-root-function
	  (lambda ()
	    (when-let (project (project-current))
	      (car (project-roots project))))))

#+end_src
