README.org
** Mu4e
#+begin_src emacs-lisp
  (when *is-a-linux*
    (use-package mu4e
      :straight nil
      :commands mu4e mu4e-compose-new
      :bind ("C-c o m" . mu4e)

      :config
      (require 'mu4e-org)

      (setq mu4e-contexts
            (list
             (make-mu4e-context
              :name "Proton"
              :match-func
              (lambda (msg)
                (when msg
                  (string-prefix-p "/Proton" (mu4e-message-field msg :maildir))))
              :vars '((user-mail-address . "jonatan.borkowski@pm.me")
                      (user-full-name . "Jonatan Borkowski")
                      (user-draft-folder . "/Proton/Drafts")
                      (mu4e-sent-folder  . "/Proton/Sent Mail")
                      (mu4e-refile-folder  . "/Proton/All Mail")
                      (mu4e-trash-folder  . "/Proton/Trash")))

             ;; Work account
             (make-mu4e-context
              :name "Work"
              :match-func
              (lambda (msg)
                (when msg
                  (string-prefix-p "/Restamatic" (mu4e-message-field msg :maildir))))
              :vars '((user-mail-address . "jonatan.borkowski@restaumatic.com")
                      (user-full-name    . "Jonatan Borkowski")
                      (mu4e-drafts-folder  . "/Restaumatic/[Gmail]/Drafts")
                      (mu4e-sent-folder  . "/Restaumatic/[Gmail]/Sent Mail")
                      (mu4e-refile-folder  . "/Restaumatic/[Gmail]/All Mail")
                      (mu4e-trash-folder  . "/Restamatic/[Gmail]/Trash")))))

      ;; Get mail
      (setq mu4e-maildir "~/.mail"
            mu4e-get-mail-command "mbsync -a"
            mu4e-change-filenames-when-moving t   ; needed for mbsync
            mu4e-update-interval 120)             ; update every 2 minutes

      ;; Send mail
      (setq mail-specify-envelope-from t
            message-send-mail-function 'smtpmail-send-it
            smtpmail-auth-credentials "~/.authinfo.gpg"
            smtpmail-smtp-server "127.0.0.1"
            message-kill-buffer-on-exit t
            smtpmail-stream-type 'starttls
            smtpmail-smtp-service 1025))

    ;; Trust certificates
    (require 'gnutls)
    (if (file-exists-p "~/.config/protonmail/bridge/cert.pem")
        (add-to-list 'gnutls-trustfiles (expand-file-name "~/.config/protonmail/bridge/cert.pem")))
    )


  (when *is-a-linux*
    (use-package org-msg
      :after mu4e
      :straight t
      :config
      (setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil tex:dvipng"
            org-msg-startup "hidestars indent inlineimages"
            org-msg-greeting-name-limit 3
            org-msg-default-alternatives '((new . (utf-8 html))
                                           (reply-to-text . (utf-8))
                                           (reply-to-html . (utf-8 html)))
            org-msg-convert-citation t)))
#+end_src
** JIRA
#+begin_src emacs-lisp
  (use-package org-jira
    :straight t
    :init
    (make-directory "~/.org-jira" 0)
    :config

    (setq jiralib-url "https://restaumatic.atlassian.net")

    (setq org-jira-custom-jqls
          '((:jql " project IN (RS) and createdDate >= '2022-01-01' order by created DESC "
                  :limit 10
                  :filename "this-years-work")
            (:jql " project IN (RS)
  AND status IN ('To Do', 'In Development')
  AND (labels = EMPTY or labels NOT IN ('FutureUpdate'))
  order by priority, created DESC "
                  :limit 20
                  :filename "ex-ahu-priority-items")
            ))
    )
#+end_src

* Development
** Direnv

#+begin_src emacs-lisp

  (use-package envrc
    :straight t
    :config
    (envrc-global-mode))

#+end_src

** Project custom
#+begin_src emacs-lisp
  (defun bore/project-override (dir)
    (let ((override (locate-dominating-file dir ".project.el")))
      (if override
          (cons 'vc override)
        nil)))
  (use-package project
    :config
    (add-hook 'project-find-functions #'bore/project-override))
#+end_src
** Language Server Protocol

#+begin_src emacs-lisp
  (use-package lsp-mode
    :straight t
    :hook ((c-mode
	    c++-mode
	    c-or-c++-mode
	    js-mode
	    rust-mode
	    typescript-mode
	    purescript-mode
	    haskell-mode
	    elixir-mode) . lsp-deferred)
    :bind (:map lsp-mode-map
		("C-c c d" . lsp-describe-thing-at-point)
		("C-c c s" . consult-lsp-symbols)
		("C-c c t" . lsp-goto-type-definition)
		("M-," . lsp-find-references)
		("M-." . lsp-find-definition)
		("C-c c f" . lsp-format-buffer)
		("C-c c x" . lsp-execute-code-action)
		("C-c c r" . lsp-rename)
		("C-c c j" . consult-lsp-symbols))
    :commands lsp lsp-deferred

    :config
    (setq lsp-idle-delay 0.5
	  lsp-diagnostics-provider t
	  lsp-keep-workspace-alive nil
	  lsp-headerline-breadcrumb-enable nil
	  lsp-modeline-code-actions-enable nil
	  lsp-modeline-diagnostics-enable nil
	  lsp-modeline-workspace-status-enable nil
	  lsp-enable-file-watchers nil
	  lsp-file-watch-threshold 5000
	  read-process-output-max (* 1024 1024))

    (with-eval-after-load "lsp-haskell"
      (lsp-register-client
       (make-lsp-client
	:new-connection (lsp-tramp-connection "haskell-language-server-wrapper")
	:remote? t
	:major-modes '(haskell-mode)
	:server-id 'haskell-mode-remote)))
    (add-hook 'lsp-completion-mode-hook
	      (lambda ()
		(setf (alist-get 'lsp-capf completion-category-defaults) '((styles . (orderless)))))))

  (use-package lsp-haskell
    :straight t
    :after (lsp haskell-mode))

  (use-package consult-lsp
    :straight t
    :after lsp-mode)

#+end_src

** Completions
*** Corfu
#+begin_src emacs-lisp

  (use-package corfu
    ;; Optional customizations
    :straight t
    :custom
    (corfu-cycle t)                ; enable cycling for `corfu-next/previous'
    (corfu-auto nil)               ; disable auto completion
    (corfu-quit-no-match t)        ; automatically quit if there is no match
    (corfu-echo-documentation nil) ; do not show documentation in the echo area
    ;; :init
    ;; (corfu-global-mode)
    )

#+end_src

*** Cape

#+begin_src emacs-lisp

  (use-package cape
    :straight t
    :after corfu
    :init
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-keyword)
    :config
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent))

#+end_src

*** Hippie-expand

#+begin_src emacs-lisp
  ;; Use the overpowered expand of the hippies
  (use-package hippie-exp
    :straight nil
    :bind ("M-/" . hippie-expand)
    :config
    (setq hippie-expand-try-functions-list
          '(try-expand-dabbrev-visible
            try-expand-dabbrev
            try-expand-dabbrev-all-buffers
            try-expand-dabbrev-from-kill
            try-complete-file-name-partially
            try-complete-file-name
            try-expand-all-abbrevs
            try-expand-list
            try-expand-line)))

#+end_src

** Flymake

#+begin_src emacs-lisp

  (use-package flymake
    :straight nil
    :hook (prog-mode . flymake-mode)
    :bind (("M-n" . flymake-goto-next-error)
	   ("M-p"  . flymake-goto-prev-error))
    :config
    (setq flymake-suppress-zero-counters t)
    (setq flymake-mode-line-counter-format
	  '(" " flymake-mode-line-error-counter
	    flymake-mode-line-warning-counter
	    flymake-mode-line-note-counter "")))

  (use-package flymake-collection
    :straight t
    :hook (after-init . flymake-collection-hook-setup))

  (use-package flymake-grammarly
      :straight t)
  (add-hook 'text-mode-hook 'flymake-grammarly-load)
  (add-hook 'latex-mode-hook 'flymake-grammarly-load)
  (add-hook 'org-mode-hook 'flymake-grammarly-load)
  (add-hook 'markdown-mode-hook 'flymake-grammarly-load)
  (add-hook 'magit-message 'flymake-grammarly-load)
#+end_src

** Reformatter
#+begin_src emacs-lisp
  (use-package reformatter
    :straight t
    :defer t)
#+end_src
* Lang
** Agda
#+begin_src emacs-lisp
  (use-package agda2-mode
    :straight t
    :mode (("\\.agda\\'" . agda2-mode)
	   ("\\.lagda.md\\'" . agda2-mode)))

  (use-package agda-input
    :straight (:package "agda-input" :type git :host github :repo "agda/agda" :files ("src/data/emacs-mode/agda-input.el")))
#+end_src
