init.el

(use-package idris2-mode
  :straight (:package "idris2-mode" :type git :host github :repo "idris-community/idris2-mode"))

(use-package haskell-mode
  :straight t
  :mode (("\\.hs\\'"    . haskell-mode)
         ("\\.cabal\\'" . haskell-cabal-mode))

  :hook ((haskell-mode . interactive-haskell-mode)
         (haskell-mode . haskell-indentation-mode)
         (haskell-mode . fourmolu-format-on-save-mode))

  :bind (:map haskell-mode-map
              ("C-c c o" . hoogle)
              ("C-c c f" . fourmolu-format-buffer))
  :custom
  (haskell-interactive-popup-errors nil)
  (haskell-process-log t)
  (haskell-process-type 'stack-ghci)
  (haskell-process-load-or-reload-prompt t)
  (haskell-process-auto-import-loaded-modules t)
  (haskell-process-suggest-hoogle-imports t)
  (haskell-process-suggest-remove-import-lines t))

(reformatter-define fourmolu-format
  :program "fourmolu"
  :args (list "--stdin-input-file" (buffer-file-name))
  :lighter " fourmolu")

(use-package ghcid
  :straight (:package "ghcid" :host nil :type git :repo "https://github.com/ndmitchell/ghcid" )
  :defer
  :load-path "site-lisp/"
  :bind (:map projectile-mode-map
              ("C-c m s" . ghcid)
              ("C-c m b" . show-ghcid-buf)
              ("C-c m t" . set-ghcid-target))
  :custom
  (ghcid-target "")
  ;;:config (setq-local default-directory projectile-project-root)
  :preface
  (use-package haskell-mode :ensure t)
  (defun show-ghcid-buf ()
    (interactive)
    (show-buffer ghcid-buf-name))
  (defun set-ghcid-target (ghcid-targ &optional ghcid-test-targ)
    (interactive
     (list
      (completing-read "ghcid target: " (map 'list (lambda (targ) (format "%s:%s" (projectile-project-name) targ)) (haskell-cabal-enum-targets)))
      (completing-read "ghcid --test target: " '("--test=main" "--test=Main.main" nil))))
    (setq ghcid-target ghcid-targ)
    (when ghcid-test-targ
      (setq ghcid-target-test (format "%s" ghcid-test-targ)))
    (kill-ghcid)
    (ghcid)))

(use-package toml-mode
  :straight t
  :mode "\\.toml\\'")

(use-package yaml-mode
  :straight t
  :mode "\\.ya?ml\\'")
(setq js-indent-level 2)

(use-package dhall-mode
  :defer t
  :config
  (set-repl-handler! 'dhall-mode #'dhall-repl-show)
  (setq dhall-format-at-save t)
  )

(use-package lua-mode
  :straight t
  :mode "\\.lua\\'")

(use-package markdown-mode
  :straight t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'"       . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :commands (markdown-mode gfm-mode)
  :config
  (setq markdown-fontify-code-blocks-natively t))

(use-package org
  :straight t
  :commands org-capture org-agenda
  :init
  (add-hook 'org-mode-hook
	    (lambda ()
	      (variable-pitch-mode 1)
	      (org-modern-mode)
	      (visual-line-mode 1)))
  :config
  (setq org-directory "~/org/"
	org-adapt-indentation nil
	org-edit-src-persistent-message nil
	org-fold-catch-invisible-edits 'show-and-error
	org-insert-heading-respect-content t
	org-fontify-quote-and-verse-blocks t
	org-tags-column 0
	org-hide-emphasis-markers t
	org-hide-macro-markers t
	org-hide-leading-stars nil
	org-ellipsis "…"
	org-capture-bookmark nil
	org-mouse-1-follows-link t
	org-pretty-entities t
	org-pretty-entities-include-sub-superscripts nil
	org-indirect-buffer-display 'current-window
	org-eldoc-breadcrumb-separator " → "
	org-enforce-todo-dependencies t
	org-startup-folded t
	org-use-sub-superscripts '{}
	org-src-fontify-natively t
	org-src-tab-acts-natively t
	org-fontify-done-headline t
	org-fontify-quote-and-verse-blocks t
	org-fontify-whole-heading-line t
	org-capture-bookmark nil
	org-priority-faces
	'((?A . error)
	  (?B . warning)
	  (?C . success))

	org-entities-user
	'(("flat"  "\\flat" nil "" "" "266D" "♭")
	  ("sharp" "\\sharp" nil "" "" "266F" "♯"))

	org-imenu-depth 6
	org-structure-template-alist
	'(("s" . "src")
	  ("e" . "src emacs-lisp")
	  ("h" . "src haskell")
	  ("E" . "example")
	  ("q" . "quote")
	  ("c" . "comment")))      )

(use-package org-modern
  :straight t
  :config
  (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.2)
  (dolist (face '((org-level-1 . 1.15)
		  (org-level-2 . 1.10)
		  (org-level-3 . 1.05)
		  (org-level-4 . 1.0)
		  (org-level-5 . 1.1)
		  (org-level-6 . 1.1)
		  (org-level-7 . 1.1)
		  (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face))
  (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.2)
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)))

(use-package denote
  :straight t
  :bind
  (("C-c n n" . denote)
   ("C-c n i" . denote-link)
   ("C-c n b" . denote-link-backlinks)
   ("C-c n l" . denote-link-find-file)
   ("C-c n r" . denote-rename-file)
   ("C-c n j" . bore/journal)
   ("C-c n f" . consult-notes))
  :config

  (setq denote-directory (expand-file-name "~/org/notes/")
	denote-known-keywords '("linux" "journal" "emacs" "embedded" "hobby")
	denote-infer-keywords t
	denote-sort-keywords t
	denote-prompt '(title keywords)
	denote-front-matter-date-format 'org-timestamp
	denote-templates '((todo . "* Tasks:\n\n"))))

(defun bore/journal ()
  "Create an entry tagged 'journal' with the date as its title"
  (interactive)
  (denote
   (format-time-string "%A %e %B %Y")
   '("journal")))

(use-package consult-notes
  :straight (:type git :host github :repo "mclear-tools/consult-notes")
  :commands (consult-notes
	     consult-notes-search-in-all-notes
	     consult-notes-org-roam-find-node
	     consult-notes-org-roam-find-node-relation)
  :config
  (setq consult-notes-file-dir-sources
	`(("Notes" ?n "~/org/notes")
	  ("Roam"  ?r "~/org/roam")))
  (when (locate-library "denote")
    (consult-notes-denote-mode)))

(use-package org-agenda
  :straight nil
  :bind
  (("C-c a" . org-agenda)
   ("C-c x" . org-capture))
  :init
  (add-hook 'org-agenda-finalize-hook (lambda () (org-modern-agenda)))
  :config
  (setq-default org-agenda-files (list org-directory)
                org-agenda-compact-blocks nil
                org-agenda-window-setup 'current-window
                org-agenda-skip-unavailable-files t
                org-agenda-span 10
                calendar-week-start-day 1
                org-agenda-start-on-weekday nil
                org-agenda-start-day "-3d"
                org-agenda-deadline-faces
                '((1.001 . error)
                  (1.0 . org-warning)
                  (0.5 . org-upcoming-deadline)
                  (0.0 . org-upcoming-distant-deadline))
                org-agenda-inhibit-startup t))

(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/org/inbox.org" "True Life Tasks")
	 "* TODO %? \n%U" :empty-lines 1)
	("w" "Todo (work)" entry (file+headline "~/org/inbox.org" "Work Tasks")
	 "* TODO %? \n%U" :empty-lines 1)
	("e" "Event" entry (file+headline "~/org/agenda.org" "Agenda")
	 "** %? \n %^T\n%U" :empty-lines 1)))

(use-package org-cliplink
  :straight t
  :config
  (global-set-key (kbd "C-c l") 'org-cliplink))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)
   (emacs-lisp . t)))

(when *is-a-mac*
  (use-package orgmark
	:straight (orgmark :host github
			   :repo "casouri/OrgMark")))

(setq js-indent-level 2
      typescript-indent-level 2
      json-reformat:indent-width 2
      css-indent-offset 2)
