README.org
** Terraform
#+begin_src emacs-lisp
  (use-package terraform-mode
    :straight t)
#+end_src
** Rust
#+begin_src emacs-lisp
  (use-package rustic
    :straight t
    :bind (:map rustic-mode-map
                ("C-c c a" . lsp-rust-analyzer-status)
                ("C-c c b" . rustic-cargo-build))
    :config
    (setq lsp-eldoc-hook nil)
    (setq rust-format-on-save t))
#+end_src
** Docker
#+begin_src emacs-lisp
  (use-package docker
    :straight t)
  (use-package dockerfile-mode
    :straight t)
#+end_src
** JavaScript and TypeScrpt
#+begin_src emacs-lisp
  (use-package js2-mode
    :straight t
    :mode "\\.jsx?\\'"
    ;; Set up proper indentation in JavaScript and JSON files
    :hook (js2-mode . prettier-format-on-save-mode)
    :init (setq-default js-indent-level 2)
    :bind (:map js2-mode-map
                ("C-c C-f"  . prettier-format-buffer))
    :config
    ;; Use js2-mode for Node scripts
    (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

    ;; Don't use built-in syntax checking
    (setq js2-mode-show-parse-errors nil
          js2-mode-show-strict-warnings nil)

    (setq js--prettify-symbols-alist nil  ; I will handle ligatures by myself
          js2-highlight-level 3))         ; More highlighting

  (reformatter-define prettier-format
    :program "prettier"
    :args (list "--stdin-filepath" (buffer-file-name))
    :lighter " prettier")

  (use-package typescript-mode
    :straight t
    :mode "\\.ts\\'"
    :hook (typescript-mode . prettier-format-on-save-mode)
    :bind (:map typescript-mode-map
                ("C-c C-f"  . prettier-format-buffer))
    :config (setq typescript-indent-level 2))
#+end_src
** PureScrpit
#+begin_src emacs-lisp
  (use-package purescript-mode
    :straight t
    :mode "\\.purs\\'"
    :hook ((purescript-mode . turn-on-purescript-indentation)
           (purescript-mode . purs-tidy-format-on-save-mode))
    :bind (:map purescript-mode-map
                ("C-c c f"  . purs-tidy-format-buffer)))

#+end_src
* The End
#+begin_src emacs-lisp

  ;;; init.el ends here

#+end_src
